import {setIcon} from '../gStyles';

export const resources = ['💎', setIcon('🪵'), '🥩', setIcon('🪨')];
export const harvest = ['🔥', ...resources];
export const trees = ['🌲', '🌴', '🌳', '🌵'];
export const flowers = ['🌾', '💐', '🌻', '🌱'];
export const nature = ['🪨', '🏔', '🌋', '🗻', '🌋']; // ⛏
export const workshops = ['🏕', '🪓', '🌾'];
export const cultivos = ['🏕', '🌱', '🌾'];
export const warriors = ['🥷🏻', '🧎🏻‍️', '🧙', '🏹', '🗼', '👸', '🤴'];

export const levels = ['👼', '👩‍🌾', '👩‍🚒', '🧝', '🥷🏻', '🧙', '👸', '🤴', '🧖🏻‍', '🧑‍🚀'];
export const tools = ['🔧', '🔨', '⚒', '🛠', '⛏', '🛡', '⚔', '️🗡', '🔪', '🪓'];
export const warriors2 = ['🏰', '🏇', '🤺', '👸', '🤴', '🥷🏻'];
export const warriors3 = ['🧜🏻‍️', '🧞', '️🦹🏼‍', '️👩🏼‍🚒', '👷‍', '️🧕', '🥷🏻'];
export const fruits = ['🍊', '🫐', '🌽', '🥦', '🍓️', '🍑', '🍏'];
export const animals = ['🐄', '🐎', '🐘', '🐓'];
export const skills = ['🛡', '⚔️', '️🪓', '⛏', '❤️', '🤼‍'];

export const resMapping = {
  '️🪓': ['🌲', '🌴', '🌳', '🌵'],
  '⛏': ['🏔', '🌋', '🗻', '🌋'],
  '🧺': ['🌾'],
};

export const natureToResource = (icon) => {
  if (nature.includes(icon)) {
    return '⛏';
  } else if (trees.includes(icon)) {
    return '️🪓';
  } else if (flowers.includes(icon)) {
    return '🧺';
  }
};

/**Cost: ['💎', '🪵', '🥩', '🪨'];*/
export const unitsMap = {
  '🧕': {
    level: 1,
    cost: {'💎': 0, '🪵': 0, '️🥩': 3, '🪨': 0},
    score: 5,
    skills: {'❤️': 10, '🛡': 0, '⚔️': 1, '🏃‍': 1},
    collect: {'️🪓': 3, '⛏': 3},
  },
  '👩‍🌾': {
    level: 1,
    cost: {'💎': 0, '🪵': 0, '️🥩': 10, '🪨': 0},
    score: 30,
    skills: {'❤️': 20, '🛡': 1, '⚔️': 2, '🏃‍': 1},
    collect: {'️🪓': 5, '⛏': 5, '🪚': 2, '🧺': 2},
  },
  '‍🧝🏽‍': {
    level: 2,
    cost: {'💎': 0, '🪵': 10, '️🥩': 10, '🪨': 0},
    score: 60,
    skills: {'❤️': 30, '🛡': 2, '⚔️': 2, '🏃‍': 1, '🏹': 10},
  },
  '🧟': {
    level: 2,
    cost: {'💎': 5, '🪵': 10, '️🥩': 50, '🪨': 0},
    score: 100,
    skills: {'❤️': 10, '🛡': 2, '⚔️': 2, '🏃‍': 3, '🏹': 1},
  },
  '🧙‍️': {
    level: 3,
    cost: {'💎': 20, '🪵': 10, '️🥩': 30, '🪨': 0},
    score: 10,
    skills: {'❤️': 50, '🛡': 2, '⚔️': 2, '🏃‍': 3, '🏹': 1},
  },
  '🤺': {
    level: 3,
    cost: {'💎': 0, '🪵': 0, '️🥩': 3, '🪨': 0},
    score: 10,
    skills: {'❤️': 50, '🛡': 2, '⚔️': 5, '🏃‍': 1},
  },
  '🐴': {
    level: 3,
    cost: {'💎': 0, '🪵': 0, '️🥩': 3, '🪨': 0},
    score: 10,
    skills: {'❤️': 20, '🛡': 3, '⚔️': 1, '🏹': 1, '🏃‍': 3},
  },
  '🥷🏻': {
    level: 4,
    cost: {'💎': 80, '🪵': 0, '️🥩': 20, '🪨': 0},
    score: 250,
    skills: {'❤️': 20, '🛡': 5, '⚔️': 5, '🏹': 1, '🏃‍': 3},
  },
  '🦹‍': {
    level: 4,
    cost: {'💎': 30, '🪵': 10, '️🥩': 10, '🪨': 0},
    score: 30,
    skills: {'❤️': 50, '🛡': 5, '⚔️': 5, '🏹': 1, '🏃‍': 3},
  },
  '🧞‍': {
    level: 5,
    cost: {'💎': 99, '🪵': 0, '️🥩': 50, '🪨': 0},
    score: 200,
    skills: {'❤️': 80, '🛡': 10, '⚔️': 10, '🏃‍': 3},
  },
  '🏰': {
    level: 5,
    cost: {'💎': 80, '🪵': 0, '️🥩': 20, '🪨': 0},
    score: 500,
    skills: {'❤️': 50, '🛡': 20, '🏹': 10, '🏃‍': 0},
  },
  '🐘': {
    level: 6,
    cost: {'💎': 10, '🪵': 10, '️🥩': 150, '🪨': 0},
    score: 10,
    skills: {'❤️': 150, '🛡': 30, '⚔️': 10, '🏹': 5, '🏃‍': 2},
  },
  '🤴': {
    level: 7,
    cost: {'💎': 10, '🪵': 10, '️🥩': 150, '🪨': 0},
    score: 500,
    skills: {'❤️': 100, '🛡': 30, '⚔️': 10, '🏹': 3, '🏃‍': 1},
  },
};
/**Cost: ['💎', '🪵', '🥩', '🪨'];*/
export const buildings = ['🗿', '⛺️', '🛖', '🏛', '🏰'];
export const buildingsMap = {
  '🗿': {
    level: 1,
    cost: {'💎': 0, '🪵': 0, '️🥩': 0, '🪨': 100},
    score: 4,
    skills: {'❤️': 10, '👨‍👩‍👧‍👦': 1},
  },
  '⛺️': {
    level: 1,
    cost: {'💎': 0, '🪵': 10, '️🥩': 10, '🪨': 0},
    score: 10,
    skills: {'❤️': 10, '👨‍👩‍👧‍👦': 3},
  },
  '🌷': {
    level: 1,
    cost: {'💎': 0, '🪵': 20, '️🥩': 10, '🪨': 0},
    score: 15,
    skills: {'❤️': 10, '🧺': 5},
  },
  '🛖': {
    level: 2,
    cost: {'💎': 0, '🪵': 50, '️🥩': 10, '🪨': 5},
    score: 30,
    skills: {'❤️': 20, '👨‍👩‍👧‍👦': 5},
  },
  '🏚': {
    level: 3,
    cost: {'💎': 0, '🪵': 100, '️🥩': 10, '🪨': 5},
    score: 30,
    skills: {'❤️': 20, '👨‍👩‍👧‍👦': 8},
  },
  '🗼': {
    level: 3,
    cost: {'💎': 0, '🪵': 100, '️🥩': 0, '🪨': 20},
    skills: {'❤️': 100, '👨‍👩‍👧‍👦': 1, '🏹': 15},
    score: 50,
  },
  '🏛': {
    level: 4,
    cost: {'💎': 0, '🪵': 10, '️🥩': 0, '🪨': 100},
    score: 75,
    skills: {'❤️': 100, '👨‍👩‍👧‍👦': 20},
  },
  '🏰': {
    level: 5,
    cost: {'💎': 100, '🪵': 20, '️🥩': 0, '🪨': 200},
    skills: {'❤️': 150, '👨‍👩‍👧‍👦': 25},
    score: 250,
  },
};
